# #ACL权限控制：用户直接跟权限相关联
#     -互联网项目，用户是互联网的用户，一般会使用这种权限
#     -抖音：（用户的权限）
#         -用户能刷视频
#         -用户能评论
#         -用户能开直播
#         -用户--》直接跟权限管理--》访问控制列表
#             -张三：[刷视频，评论，直播]
#             -李四：[刷视频]

#     -优酷
#         -普通用户看视频有广告，不能看会员视频，不能看超级会员视频
#         -充值用户看视频没广告，能看会员视频，不能看超级会员视频
#         -超级用户 看视频没广告，能看会员视频，能看超级会员视频

# #RBAC权限控制：基于角色的访问控制
#     -公司内部项目，公司有部门，有角色
#     -公司的OA系统
#         -角色是人事专员：
#             -增加用户，删除用户。修改用户，招聘用户，发工资
#         -角色是开发：
#             -删除代码，提交代码..
#         -角色是股东：
#             -开董事会，裁人
#     -权限不是直接跟某个用户相关联---》跟某一类用户相关联
#         -只要把某个权限授予一个群体--》群体内所有人都有这个权限
    
#     -用户表，角色表，权限表，用户和角色中间表，角色和权限中间表
#         -用户和角色：多对多
#             -一个用户可以有多个角色，一个角色可以有多个用户
#         -角色和权限：多对多
#             -一个角色有多个权限，一个权限可以属于多个角色

#     -公司内部的项目都需要有这个权限
#         -这个系统的公司内部只要写项目就都会用它

#     #ABAC权限控制：公司内部用
#         -在RBAC的基础信号那个，加了属性控制